Catalogs/ВидыДеятельностиПредпринимателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ВидыДеятельностиПредпринимателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХарактерДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОсуществления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыДеятельностиПредпринимателей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу() Тогда
		
		ПерваяНоменклатурнаяГруппа = РегистрыСведений.ВидыДеятельностиПредпринимателей.ПолучитьПервуюНоменклатурнуюГруппу(Ссылка, ХарактерДеятельности);
		
		Если НЕ ЗначениеЗаполнено(ПерваяНоменклатурнаяГруппа) Тогда
			МенеджерЗаписиРегистра = РегистрыСведений.ВидыДеятельностиПредпринимателей.СоздатьМенеджерЗаписи();
			МенеджерЗаписиРегистра.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
			МенеджерЗаписиРегистра.ВидДеятельности      = Ссылка;
			МенеджерЗаписиРегистра.ХарактерДеятельности = ХарактерДеятельности;
			МенеджерЗаписиРегистра.Записать(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	// Очистка регистра сведений от записей не соответствующих заданному характеру деятельности
	РегистрыСведений.ВидыДеятельностиПредпринимателей.ОчиститьСписокНоменклатуныхГрупп(Ссылка, ХарактерДеятельности);
	
	Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
		
		Если НЕ РегистрыСведений.ВидыДеятельностиПредпринимателей.ПолучитьВидДеятельности(ХарактерДеятельности, НоменклатурнаяГруппа) = Ссылка Тогда
			
			// В качестве основной номенклатурной группы указана номенклатурная групппа
			// не связанная с видом деятельности
			НоменклатурнаяГруппа	= Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// Проверка необходимости очистки повторно используемых значений
		Если НЕ ХарактерДеятельности = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьХарактерДеятельности(Ссылка)
			ИЛИ НЕ НоменклатурнаяГруппа = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьНоменклатурнуюГруппу(Ссылка) Тогда
			
			ОбновитьПовторноИспользуемыеЗначения();
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу() И  НЕ ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
		
		НоменклатурнаяГруппа = БухгалтерскийУчетВызовСервераПовтИсп.ОсновнаяНоменклатурнаяГруппа();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
